# @masuidrive  増井 雄一郎さんからの正規表現の問題
# 正規表現でどう書くの？
# https://codeiq.jp/ace/masui_yuichiro/q981


# 処理開始時刻
t0 = Time.now
puts "処理開始時刻：#{t0}"
print "\n"

# 正規表現: "123456" =~ /([0-9]+ア)/
# 条件: $1 == "1"
p /([0-9]+?)/.match("123456")

# 正規表現: "123456" =~ /(イ[0-9]+ア)([0-9]+)/
# 条件: $1 == "23456"
p /([0-9]+?)([0-9]+)/.match("123456")

# 正規表現: "123456" =~ /123(ウ45)4/
# 条件: マッチする
p /123(45)4/.match("123456")

# 正規表現: "123456" =~ /123(ウ45)6/
# 条件: マッチしない
p /123(45)6/.match("123456")

# 処理終了時刻
t1 = Time.now
print "\n"
puts "処理終了時刻：#{t1}"

# 処理時間
puts "処理時間：#{t1 - t0} sec"
